In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4])

In [6]:
#median
median = np.median(x)
threshold = 2
outliers = []
for item in x:
    if abs(item - median) > threshold:
        outliers.append(item)

print(outliers)

[4.5]

In [10]:
#mean
mean = np.mean(x)
std = np.std(x)
outliers = []
for item in x:
    if (item < (mean - std) or (item > mean + std)):
        outliers.append(item)
        
print(outliers)

[4.5]

In [11]:
#z score
mean = np.mean(x)
std = np.std(x)
outliers = []
for item in x:
    z_score = (item - mean) / std
    if z_score > 1.5:
        outliers.append(item)
        
print(outliers)

[4.5]

In [12]:
#interquartile
Q1, Q3 = np.percentile(x, [25, 75])
IQR = Q3 - Q1
outliers = []
for item in x:
    if item < (Q1 - 1.5 * IQR) or item > (Q3 + 1.5 * IQR):
        outliers.append(item)
        
print(outliers)

[4.5]

Missing values

In [13]:
from numpy import NaN

data1 = {'Nama' : ['Edison', 'Edward', 'James', 'Nasution'],
        'Umur' : [28, 27, NaN, 36]}

In [14]:
data = pd.DataFrame.from_dict(data1)
data

       Nama  Umur
0    Edison  28.0
1    Edward  27.0
2     James   NaN
3  Nasution  36.0

In [15]:
data.isnull()

    Nama   Umur
0  False  False
1  False  False
2  False   True
3  False  False

In [16]:
data.isnull().sum()

Nama    0
Umur    1
dtype: int64

In [17]:
data.dropna(inplace=True)
data

       Nama  Umur
0    Edison  28.0
1    Edward  27.0
3  Nasution  36.0

In [18]:
data = pd.DataFrame.from_dict(data1)
data

       Nama  Umur
0    Edison  28.0
1    Edward  27.0
2     James   NaN
3  Nasution  36.0

In [19]:
data.fillna(data.mean(), inplace=True)
data

C:\Users\SETYA\AppData\Local\Temp/ipykernel_6572/3452971976.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.fillna(data.mean(), inplace=True)

       Nama       Umur
0    Edison  28.000000
1    Edward  27.000000
2     James  30.333333
3  Nasution  36.000000

In [20]:
data = pd.DataFrame.from_dict(data1)
data

       Nama  Umur
0    Edison  28.0
1    Edward  27.0
2     James   NaN
3  Nasution  36.0

In [21]:
data['Umur'].mode()

0    27.0
1    28.0
2    36.0
Name: Umur, dtype: float64

In [22]:
data['Umur'].fillna(data['Umur'].mode()[0], inplace=True)

In [23]:
data

       Nama  Umur
0    Edison  28.0
1    Edward  27.0
2     James  27.0
3  Nasution  36.0

Regular Expressions

In [24]:
import re

In [25]:
txt = 'Python is my faborite programminng language. I lobe Python.'
x = re.findall('Python', txt)
x

['Python', 'Python']

In [26]:
len(x)

2

In [28]:
x = 'Python is my favorite programming language'
re.findall('^Python', x)

['Python']

In [32]:
y = 'I love Python.'
re.findall('^Python', y)

[]

In [33]:
text = 'Python was released in 1991'
re.findall('\d', text)

['1', '9', '9', '1']

In [34]:
re.findall('\d+', text)

['1991']

In [36]:
import pandas as pd
import re

In [38]:
txtList = ['Pakistan', 'Indonesia', 'Palestina', 'Indonesia']
txt = pd.Series(txtList)
txt

0     Pakistan
1    Indonesia
2    Palestina
3    Indonesia
dtype: object

In [39]:
re.findall('Indonesia', txt.to_string())

['Indonesia', 'Indonesia']